# FabricationVersionInfo Class

---
The object contains versioning information about fabrication data.
SystemObject Autodesk.Revit.DBFabricationVersionInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FabricationVersionInfo : IDisposable

    Public Class FabricationVersionInfo
    	Implements IDisposable

    public ref class FabricationVersionInfo : IDisposable

    type FabricationVersionInfo =
        class
            interface IDisposable
        end
The FabricationVersionInfo type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Reason|  The user-specified reason for the change.
| Version|  The version number of the change.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the FabricationVersionInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace